# Pandas for Data Manipulation and Analysis

In [2]:
#Pandas For Data Analysis 
#Import Pandas
import pandas as pd

In [4]:
#Find working directory
import os
os.getcwd()

'/Users/robertwrobel/Code/Python4Statistics/Notebooks'

In [4]:
#Read and Excel file and a CSV file into two separate data frames
df1 = pd.read_csv('../data/data.csv')
df2 = pd.read_excel('../data/data.xlsx')

#If on Windows, and you copy the file path, you'll need to either flip the slashes from "\" to "/" or put an "r" in front of the path string

#To select a specifc sheet from an Excel workbook
#df = pd.read_excel(r'File path', sheet_name='Sheet name')

In [8]:
#View variable names and data dypes
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      100 non-null    object
 1   Age       99 non-null     float64
 2   Category  99 non-null     object
 3   Value     98 non-null     float64
 4   Count     99 non-null     float64
dtypes: float64(3), object(2)
memory usage: 4.0+ KB

In [8]:
#View variable names
print(df1.columns)

#Store variable names in a list
list_of_vars = df1.columns.tolist()
print(list_of_vars)

Index(['Name', 'Age', 'Category', 'Value', 'Count'], dtype='object')
['Name', 'Age', 'Category', 'Value', 'Count']

In [12]:
#View the first 5 rows of df1, the first 10 rows of df1, and the last 10 rows of df2
print(df1.head()) #5 is the default
print(df1.head(10))
print(df2.tail(10))

               Name  Age Category  Value  Count
0      Nicole Allen   25        C   54.0    5.0
1  Anthony Martinez   54        A   49.0    8.0
2     Shawn Gilbert   39        B   64.0    3.0
3        Eric Ellis   35        A   35.0    4.0
4    Chelsea Flores   24        C    6.0    3.0
               Name  Age Category  Value  Count
0      Nicole Allen   25        C   54.0    5.0
1  Anthony Martinez   54        A   49.0    8.0
2     Shawn Gilbert   39        B   64.0    3.0
3        Eric Ellis   35        A   35.0    4.0
4    Chelsea Flores   24        C    6.0    3.0
5      Karen Carson   51        C   71.0    2.0
6     Rhonda Wilcox   51        A   53.0   10.0
7      Barbara Tran   24        A   62.0    9.0
8      Matthew Ward   31        B   40.0    8.0
9       Joshua Ware   19        A   81.0    4.0
                    Name  Age Category  Value  Count
90          Donald Ayala   56        B   33.0    2.0
91          John Ramirez   39        A   69.0    5.0
92     Dr. Jonathan Cook   27        B   83.0    9.0
93        Michael Miller   37        A   19.0    2.0
94        Karen Williams   47        B   29.0    8.0
95          Jamie Knight   52        B   34.0   10.0
96          Linda Dalton   61        A   61.0    3.0
97        Donald Blevins   60        C   58.0    4.0
98  Mrs. Mary Sampson MD   42        C   81.0    5.0
99    Lawrence Rodriguez   59        B   23.0    9.0

In [84]:
#Summary statistics
df1.describe()

              Age       Value      Count
count  100.000000   98.000000  99.000000
mean    40.260000   45.530612   5.232323
std     14.059484   28.023629   2.791490
min     18.000000    1.000000   1.000000
25%     27.750000   21.250000   3.000000
50%     41.000000   43.500000   5.000000
75%     52.250000   64.750000   7.500000
max     64.000000  100.000000  10.000000

In [86]:
#Count duplicate rows
duplicate_count = df1.duplicated().sum()
print(duplicate_count)

#Display which rows have duplicates and which do not
duplicates = df1.duplicated()
print(duplicates)

#View instances of the duplicated rows
duplicated_rows = df1[df1.duplicated()]
duplicated_rows

2
0     False
1     False
2     False
3     False
4     False
      ...
95    False
96    False
97    False
98    False
99    False
Length: 100, dtype: bool

               Name  Age Category  Value  Count
17  Alexandra Green   21        C    7.0    9.0
24      Mark Hester   35        C   44.0    4.0

In [88]:
#Checking for duplicates using a subset of columns instead of looking for exact duplicates
duplicates = df1[df1.duplicated(subset=['Name', 'Age'])]
print(duplicates)

               Name  Age Category  Value  Count
17  Alexandra Green   21        C    7.0    9.0
24      Mark Hester   35        C   44.0    4.0

In [90]:
#Drop duplicate rows
df1.drop_duplicates(inplace=True)

In [92]:
#Duplicates are now gone
duplicated_rows = df1[df1.duplicated()]
duplicated_rows

Empty DataFrame
Columns: [Name, Age, Category, Value, Count]
Index: []

In [94]:
#Count missing values, display rows with missing values, and drop rows with missing values
print(df1.isnull().sum())

missing_data = df1[df1.isna().any(axis=1)]
print(missing_data)

df1.dropna(inplace=True) # "inplace=True" modifies the existing data frame
print(df1.isnull().sum())

Name        0
Age         0
Category    1
Value       2
Count       1
dtype: int64
                Name  Age Category  Value  Count
13    Rachel Salinas   55      NaN    4.0    2.0
20        Dana Hodge   21        C    NaN    3.0
28  Jonathan Coleman   53        A    NaN    NaN
Name        0
Age         0
Category    0
Value       0
Count       0
dtype: int64

In [96]:
#All rows with any missing data are now gone
print(df1.isnull().sum())

missing_data = df1[df1.isna().any(axis=1)]
print(missing_data)

Name        0
Age         0
Category    0
Value       0
Count       0
dtype: int64
Empty DataFrame
Columns: [Name, Age, Category, Value, Count]
Index: []

In [98]:
#Dropping a row:
#df1.drop(index=1, inplace=True)

#Dropping multiple rows:
df1 = df1.drop(index=[3, 8])  #Removes rows with index 0 and 2

In [100]:
#Adding a row:
#New row as a DataFrame
new_row = pd.DataFrame({'A': [4], 'B': ['d']})

#Concatenate the original DataFrame and the new row
df1 = pd.concat([df1, new_row], ignore_index=True)

In [102]:
#Map with a dictionary
m = {'A':'Awesome','B':'Sub-Awesome','C':'Sub-Awesome'}
df1['Category2'] = df1['Category'].map(m)
df1.head(10)

               Name   Age Category  Value  Count   A    B    Category2
0      Nicole Allen  25.0        C   54.0    5.0 NaN  NaN  Sub-Awesome
1  Anthony Martinez  54.0        A   49.0    8.0 NaN  NaN      Awesome
2     Shawn Gilbert  39.0        B   64.0    3.0 NaN  NaN  Sub-Awesome
3    Chelsea Flores  24.0        C    6.0    3.0 NaN  NaN  Sub-Awesome
4      Karen Carson  51.0        C   71.0    2.0 NaN  NaN  Sub-Awesome
5     Rhonda Wilcox  51.0        A   53.0   10.0 NaN  NaN      Awesome
6      Barbara Tran  24.0        A   62.0    9.0 NaN  NaN      Awesome
7       Joshua Ware  19.0        A   81.0    4.0 NaN  NaN      Awesome
8   William Stewart  54.0        C   43.0    5.0 NaN  NaN  Sub-Awesome
9   Jonathon Thomas  23.0        B   75.0   10.0 NaN  NaN  Sub-Awesome

In [104]:
#Map with a funciton
average_age = df1['Age'].mean()
print(average_age)

def above_average_age(x):
    if x > average_age:
        return 1
    else:
        return 0

df1['Above Average Age'] = df1['Age'].map(above_average_age)
df1.head(10)

40.59139784946237

,Name,Age,Category,Value,Count,A,B,Category2,Above Average Age
0,Nicole Allen,25.0,C,54.0,5.0,NaN,NaN,Sub-Awesome,0
1,Anthony Martinez,54.0,A,49.0,8.0,NaN,NaN,Awesome,1
2,Shawn Gilbert,39.0,B,64.0,3.0,NaN,NaN,Sub-Awesome,0
3,Chelsea Flores,24.0,C,6.0,3.0,NaN,NaN,Sub-Awesome,0
4,Karen Carson,51.0,C,71.0,2.0,NaN,NaN,Sub-Awesome,1
5,Rhonda Wilcox,51.0,A,53.0,10.0,NaN,NaN,Awesome,1
6,Barbara Tran,24.0,A,62.0,9.0,NaN,NaN,Awesome,0
7,Joshua Ware,19.0,A,81.0,4.0,NaN,NaN,Awesome,0
8,William Stewart,54.0,C,43.0,5.0,NaN,NaN,Sub-Awesome,1
9,Jonathon Thomas,23.0,B,75.0,10.0,NaN,NaN,Sub-Awesome,0

In [106]:
#Create a running total 
df1['Running Count Total'] = df1['Count'].cumsum()
df1.head()

,Name,Age,Category,Value,Count,A,B,Category2,Above Average Age,Running Count Total
0,Nicole Allen,25.0,C,54.0,5.0,NaN,NaN,Sub-Awesome,0,5.0
1,Anthony Martinez,54.0,A,49.0,8.0,NaN,NaN,Awesome,1,13.0
2,Shawn Gilbert,39.0,B,64.0,3.0,NaN,NaN,Sub-Awesome,0,16.0
3,Chelsea Flores,24.0,C,6.0,3.0,NaN,NaN,Sub-Awesome,0,19.0
4,Karen Carson,51.0,C,71.0,2.0,NaN,NaN,Sub-Awesome,1,21.0

In [108]:
#Create a new calcualted variable out of existing variables
df1['ValueMinusCount'] = df1['Value'] - df1['Count']
df1.head()

,Name,Age,Category,Value,Count,A,B,Category2,Above Average Age,Running Count Total,ValueMinusCount
0,Nicole Allen,25.0,C,54.0,5.0,NaN,NaN,Sub-Awesome,0,5.0,49.0
1,Anthony Martinez,54.0,A,49.0,8.0,NaN,NaN,Awesome,1,13.0,41.0
2,Shawn Gilbert,39.0,B,64.0,3.0,NaN,NaN,Sub-Awesome,0,16.0,61.0
3,Chelsea Flores,24.0,C,6.0,3.0,NaN,NaN,Sub-Awesome,0,19.0,3.0
4,Karen Carson,51.0,C,71.0,2.0,NaN,NaN,Sub-Awesome,1,21.0,69.0

In [110]:
#Drop a column
df1.drop('ValueMinusCount', axis=1, inplace=True)

In [112]:
#loc - Select a cell using row numbers and column names
#loc uses labels - loc[row_label, column_label]
print(df1.loc[2, 'Age']) #Get the value of the age column in row 2
print(df1.loc[2:6, 'Age']) #Get the value of the age column in rows indexed 2 through 6

39.0
2    39.0
3    24.0
4    51.0
5    51.0
6    24.0
Name: Age, dtype: float64

In [114]:
#iloc - Select a cell using row numbers and column numbers
#iloc uses integers corresponding to position - iloc[row_position, column_position]
print(df1.iloc[4,4])
print(df1.iloc[1:3,2:4])

2.0
  Category  Value
1        A   49.0
2        B   64.0

In [116]:
#Split "Text to columns"
df1[['First Name', 'Last Name']] = df1['Name'].str.split(n=1, expand=True)
df1.columns
df1.head()

,Name,Age,Category,Value,Count,A,B,Category2,Above Average Age,Running Count Total,First Name,Last Name
0,Nicole Allen,25.0,C,54.0,5.0,NaN,NaN,Sub-Awesome,0,5.0,Nicole,Allen
1,Anthony Martinez,54.0,A,49.0,8.0,NaN,NaN,Awesome,1,13.0,Anthony,Martinez
2,Shawn Gilbert,39.0,B,64.0,3.0,NaN,NaN,Sub-Awesome,0,16.0,Shawn,Gilbert
3,Chelsea Flores,24.0,C,6.0,3.0,NaN,NaN,Sub-Awesome,0,19.0,Chelsea,Flores
4,Karen Carson,51.0,C,71.0,2.0,NaN,NaN,Sub-Awesome,1,21.0,Karen,Carson

In [118]:
#Concatenation
df1['Full Name Rejoined'] = df1['First Name'] + ' ' + df1['Last Name']

#If not a string already
df1['Full Name With Value'] = df1['Full Name Rejoined'] + ' ' + df1['Value'].astype(str)

df1.head()

,Name,Age,Category,Value,Count,A,B,Category2,Above Average Age,Running Count Total,First Name,Last Name,Full Name Rejoined,Full Name With Value
0,Nicole Allen,25.0,C,54.0,5.0,NaN,NaN,Sub-Awesome,0,5.0,Nicole,Allen,Nicole Allen,Nicole Allen 54.0
1,Anthony Martinez,54.0,A,49.0,8.0,NaN,NaN,Awesome,1,13.0,Anthony,Martinez,Anthony Martinez,Anthony Martinez 49.0
2,Shawn Gilbert,39.0,B,64.0,3.0,NaN,NaN,Sub-Awesome,0,16.0,Shawn,Gilbert,Shawn Gilbert,Shawn Gilbert 64.0
3,Chelsea Flores,24.0,C,6.0,3.0,NaN,NaN,Sub-Awesome,0,19.0,Chelsea,Flores,Chelsea Flores,Chelsea Flores 6.0
4,Karen Carson,51.0,C,71.0,2.0,NaN,NaN,Sub-Awesome,1,21.0,Karen,Carson,Karen Carson,Karen Carson 71.0

In [124]:
#Reordering Columns
# :10 slices to select all columns up to the 10th 
# 12: slices to select all columns from the 12th on
columns = df1.columns.tolist()
new_cols = [columns[10]] + [columns[11]] + columns[:10] + columns[12:]
df_arranged = df1[new_cols]
df_arranged.head()

['Name',
 'Age',
 'Category',
 'Value',
 'Count',
 'A',
 'B',
 'Category2',
 'Above Average Age',
 'Running Count Total',
 'First Name',
 'Last Name',
 'Full Name Rejoined',
 'Full Name With Value']

In [14]:
#Renaming columns with a dictionary
df1.rename(columns={'Name': 'Full Name','Count':'Whatever'}, inplace=True)
df1.head()

          Full Name  Age Category  Value  Whatever
0      Nicole Allen   25        C   54.0       5.0
1  Anthony Martinez   54        A   49.0       8.0
2     Shawn Gilbert   39        B   64.0       3.0
3        Eric Ellis   35        A   35.0       4.0
4    Chelsea Flores   24        C    6.0       3.0

In [78]:
#Filter rows based on condition
over30 = df1[df1['Age'] > 30]
over30.head()

,Full Name,Age,Category,Value,Count,Category2,Above Average Age,Running Count Total,First Name,Last Name,Full Name Rejoined,Full Name With Value
1,Anthony Martinez,54,A,49.0,8.0,Awesome,1,13.0,Anthony,Martinez,Anthony Martinez,Anthony Martinez 49.0
2,Shawn Gilbert,39,B,64.0,3.0,Sub-Awesome,0,16.0,Shawn,Gilbert,Shawn Gilbert,Shawn Gilbert 64.0
3,Eric Ellis,35,A,35.0,4.0,Awesome,0,20.0,Eric,Ellis,Eric Ellis,Eric Ellis 35.0
5,Karen Carson,51,C,71.0,2.0,Sub-Awesome,1,25.0,Karen,Carson,Karen Carson,Karen Carson 71.0
6,Rhonda Wilcox,51,A,53.0,10.0,Awesome,1,35.0,Rhonda,Wilcox,Rhonda Wilcox,Rhonda Wilcox 53.0

In [79]:
#Sorting by a column
age_desc = df1.sort_values('Age', ascending=False)
print(age_desc)

            Full Name  Age Category  Value  Count    Category2  \
56  Angela Oneill DDS   64        C   55.0    3.0  Sub-Awesome
47      Melissa Lewis   63        B   72.0    2.0  Sub-Awesome
14          Lisa Chen   61        B   41.0   10.0  Sub-Awesome
31      Joshua Hughes   61        B   41.0    1.0  Sub-Awesome
34       Sandra Jones   61        C   32.0    6.0  Sub-Awesome
..                ...  ...      ...    ...    ...          ...
9         Joshua Ware   19        A   81.0    4.0      Awesome
83        Megan Brown   19        C   95.0    1.0  Sub-Awesome
81       Peter Hansen   19        C   55.0    4.0  Sub-Awesome
40   Brenda Valentine   19        A   31.0    7.0      Awesome
53       Stanley Dean   18        A   30.0   10.0      Awesome

    Above Average Age  Running Count Total First Name   Last Name  \
56                  1                270.0     Angela  Oneill DDS
47                  1                221.0    Melissa       Lewis
14                  1                 83.0       Lisa        Chen
31                  1                152.0     Joshua      Hughes
34                  1                162.0     Sandra       Jones
..                ...                  ...        ...         ...
9                   0                 56.0     Joshua        Ware
83                  0                419.0      Megan       Brown
81                  0                414.0      Peter      Hansen
40                  0                191.0     Brenda   Valentine
53                  0                259.0    Stanley        Dean

   Full Name Rejoined    Full Name With Value
56  Angela Oneill DDS  Angela Oneill DDS 55.0
47      Melissa Lewis      Melissa Lewis 72.0
14          Lisa Chen          Lisa Chen 41.0
31      Joshua Hughes      Joshua Hughes 41.0
34       Sandra Jones       Sandra Jones 32.0
..                ...                     ...
9         Joshua Ware        Joshua Ware 81.0
83        Megan Brown        Megan Brown 95.0
81       Peter Hansen       Peter Hansen 55.0
40   Brenda Valentine   Brenda Valentine 31.0
53       Stanley Dean       Stanley Dean 30.0

[95 rows x 12 columns]

In [80]:
age_asc = df1.sort_values('Age', ascending=True)
print(age_asc)

            Full Name  Age Category  Value  Count    Category2  \
53       Stanley Dean   18        A   30.0   10.0      Awesome
40   Brenda Valentine   19        A   31.0    7.0      Awesome
50      James Tran MD   19        B   15.0    1.0  Sub-Awesome
9         Joshua Ware   19        A   81.0    4.0      Awesome
81       Peter Hansen   19        C   55.0    4.0  Sub-Awesome
..                ...  ...      ...    ...    ...          ...
14          Lisa Chen   61        B   41.0   10.0  Sub-Awesome
96       Linda Dalton   61        A   61.0    3.0      Awesome
34       Sandra Jones   61        C   32.0    6.0  Sub-Awesome
47      Melissa Lewis   63        B   72.0    2.0  Sub-Awesome
56  Angela Oneill DDS   64        C   55.0    3.0  Sub-Awesome

    Above Average Age  Running Count Total First Name   Last Name  \
53                  0                259.0    Stanley        Dean
40                  0                191.0     Brenda   Valentine
50                  0                239.0      James     Tran MD
9                   0                 56.0     Joshua        Ware
81                  0                414.0      Peter      Hansen
..                ...                  ...        ...         ...
14                  1                 83.0       Lisa        Chen
96                  1                482.0      Linda      Dalton
34                  1                162.0     Sandra       Jones
47                  1                221.0    Melissa       Lewis
56                  1                270.0     Angela  Oneill DDS

   Full Name Rejoined    Full Name With Value
53       Stanley Dean       Stanley Dean 30.0
40   Brenda Valentine   Brenda Valentine 31.0
50      James Tran MD      James Tran MD 15.0
9         Joshua Ware        Joshua Ware 81.0
81       Peter Hansen       Peter Hansen 55.0
..                ...                     ...
14          Lisa Chen          Lisa Chen 41.0
96       Linda Dalton       Linda Dalton 61.0
34       Sandra Jones       Sandra Jones 32.0
47      Melissa Lewis      Melissa Lewis 72.0
56  Angela Oneill DDS  Angela Oneill DDS 55.0

[95 rows x 12 columns]

In [81]:
#Rank and Percentile
df1['Age_Rank'] = df1['Age'].rank()
df1['Age_Percentile'] = df1['Age_Rank'] / df1['Age'].count()
df1.head()

,Full Name,Age,Category,Value,Count,Category2,Above Average Age,Running Count Total,First Name,Last Name,Full Name Rejoined,Full Name With Value,Age_Rank,Age_Percentile
0,Nicole Allen,25,C,54.0,5.0,Sub-Awesome,0,5.0,Nicole,Allen,Nicole Allen,Nicole Allen 54.0,22.0,0.231579
1,Anthony Martinez,54,A,49.0,8.0,Awesome,1,13.0,Anthony,Martinez,Anthony Martinez,Anthony Martinez 49.0,75.0,0.789474
2,Shawn Gilbert,39,B,64.0,3.0,Sub-Awesome,0,16.0,Shawn,Gilbert,Shawn Gilbert,Shawn Gilbert 64.0,43.0,0.452632
3,Eric Ellis,35,A,35.0,4.0,Awesome,0,20.0,Eric,Ellis,Eric Ellis,Eric Ellis 35.0,34.5,0.363158
4,Chelsea Flores,24,C,6.0,3.0,Sub-Awesome,0,23.0,Chelsea,Flores,Chelsea Flores,Chelsea Flores 6.0,19.5,0.205263

In [82]:
#Merging data frames
dfL = pd.DataFrame({'ID': [1, 2, 3, 4], 'Economics Grade': ['A', 'B', 'C','D']})
dfR = pd.DataFrame({'ID': [3, 4, 5, 6], 'Statistics Grade': ['C', 'D', 'A','F']})
print(dfL.head())
print(dfR.head())

   ID Economics Grade
0   1               A
1   2               B
2   3               C
3   4               D
   ID Statistics Grade
0   3                C
1   4                D
2   5                A
3   6                F

In [83]:
#Inner join
inner_merged_df = pd.merge(dfL, dfR, on='ID', how='inner')
print(inner_merged_df)

   ID Economics Grade Statistics Grade
0   3               C                C
1   4               D                D

In [84]:
#Outer join
outer_merged_df = pd.merge(dfL, dfR, on='ID', how="outer")
print(outer_merged_df)

   ID Economics Grade Statistics Grade
0   1               A              NaN
1   2               B              NaN
2   3               C                C
3   4               D                D
4   5             NaN                A
5   6             NaN                F

In [85]:
#Left join
left_merged_df = pd.merge(dfL, dfR, on='ID', how="left")
print(left_merged_df)

   ID Economics Grade Statistics Grade
0   1               A              NaN
1   2               B              NaN
2   3               C                C
3   4               D                D

In [86]:
#Right join
right_merged_df = pd.merge(dfL, dfR, on='ID', how="right")
print(right_merged_df)

   ID Economics Grade Statistics Grade
0   3               C                C
1   4               D                D
2   5             NaN                A
3   6             NaN                F

In [87]:
#Binning w/ Cut
import numpy as np
x = np.random.randint(100, size=10)

#Divide into three bins
y = pd.cut(x, 3)
print(y)
#Divide into three labled bins
z = pd.cut(x, 3, labels=["bad", "medium", "good"])
print(z)
#Divide into specified bins
w = pd.cut(x, bins=[0, 10, 20, 30, 40, 50, 60, 70, np.inf])
print(w)

#Print frequency by bin
bin_counts = w.value_counts()
print(bin_counts)

[(59.333, 77.667], (40.945, 59.333], (77.667, 96.0], (40.945, 59.333], (77.667, 96.0], (40.945, 59.333], (77.667, 96.0], (40.945, 59.333], (77.667, 96.0], (77.667, 96.0]]
Categories (3, interval[float64, right]): [(40.945, 59.333] < (59.333, 77.667] < (77.667, 96.0]]
['medium', 'bad', 'good', 'bad', 'good', 'bad', 'good', 'bad', 'good', 'good']
Categories (3, object): ['bad' < 'medium' < 'good']
[(60.0, 70.0], (50.0, 60.0], (70.0, inf], (40.0, 50.0], (70.0, inf], (50.0, 60.0], (70.0, inf], (40.0, 50.0], (70.0, inf], (70.0, inf]]
Categories (8, interval[float64, right]): [(0.0, 10.0] < (10.0, 20.0] < (20.0, 30.0] < (30.0, 40.0] < (40.0, 50.0] < (50.0, 60.0] < (60.0, 70.0] < (70.0, inf]]
(0.0, 10.0]     0
(10.0, 20.0]    0
(20.0, 30.0]    0
(30.0, 40.0]    0
(40.0, 50.0]    2
(50.0, 60.0]    2
(60.0, 70.0]    1
(70.0, inf]     5
dtype: int64

In [110]:
#Frequency table

#New demo dataframe
df = pd.DataFrame({
    'Gender': ['Male', 'Female', 'Female', 'Male', 'Female', 'Male'],
    'Product': ['A', 'A', 'B', 'B', 'A', 'C'],
    'Profit': [100, 100, 200, 200, 100, 50],
    'Visits': [1, 3, 6, 2, 8, 1]
})


frequency_table_products = df['Product'].value_counts()
print(frequency_table_products) 
print("\n")
frequency_table_gender = df['Gender'].value_counts()
print(frequency_table_gender)

df.head()

Product
A    3
B    2
C    1
Name: count, dtype: int64


Gender
Male      3
Female    3
Name: count, dtype: int64

   Gender Product  Profit  Visits
0    Male       A     100       1
1  Female       A     100       3
2  Female       B     200       6
3    Male       B     200       2
4  Female       A     100       8

In [102]:
#Crosstabulation
print(pd.crosstab(index=df['Gender'], columns=df['Product']))

print("\n") #Spacing

print(pd.crosstab(index=df['Gender'], columns=df['Product'], values=df['Profit'], aggfunc='sum'))

Product  A  B  C
Gender
Female   2  1  0
Male     1  1  1


Product      A      B     C
Gender
Female   200.0  200.0   NaN
Male     100.0  200.0  50.0

In [126]:
#Create Dummy Variables Categorical Variables 
dfdb = pd.get_dummies(df) #Boolean dummies for all categorical variables 
print(dfdb.head())

dfdi = pd.get_dummies(df, dtype=int) #Integer dummies for all categorical variables
print(dfdi.head())

dfd3 = pd.get_dummies(df, columns=['Product'], dtype=int) #Integer dummies for specific categorical variables
print(dfd3.head())

   Profit  Visits  Gender_Female  Gender_Male  Product_A  Product_B  Product_C
0     100       1          False         True       True      False      False
1     100       3           True        False       True      False      False
2     200       6           True        False      False       True      False
3     200       2          False         True      False       True      False
4     100       8           True        False       True      False      False
   Profit  Visits  Gender_Female  Gender_Male  Product_A  Product_B  Product_C
0     100       1              0            1          1          0          0
1     100       3              1            0          1          0          0
2     200       6              1            0          0          1          0
3     200       2              0            1          0          1          0
4     100       8              1            0          1          0          0
   Gender  Profit  Visits  Product_A  Product_B  Product_C
0    Male     100       1          1          0          0
1  Female     100       3          1          0          0
2  Female     200       6          0          1          0
3    Male     200       2          0          1          0
4  Female     100       8          1          0          0

In [156]:
#Grouping and Aggregating Statistics
group1 = df.groupby(['Gender']).aggregate({'Profit':'mean'}) #One group variable, one variable, one statistic
print(group1)

group2 = df.groupby(['Gender']).aggregate({'Profit':['mean','max']}) #One group variable, one variable, two statistics
print(group2)

group3 = df.groupby(['Gender','Product']).aggregate({'Profit':['min','max', 'mean'],'Visits':['min','max']}) #Two group variables, two variables, five statistics
print(group3)

            Profit
Gender
Female  133.333333
Male    116.666667
            Profit
              mean  max
Gender
Female  133.333333  200
Male    116.666667  200
               Profit             Visits
                  min  max   mean    min max
Gender Product
Female A          100  100  100.0      3   8
       B          200  200  200.0      6   6
Male   A          100  100  100.0      1   1
       B          200  200  200.0      2   2
       C           50   50   50.0      1   1

In [92]:
#Pivot tables
pivot_table = df1.pivot_table(values='Value', index='Category', columns='Count', aggfunc='sum')
print(pivot_table)

Count      1.0    2.0    3.0    4.0    5.0    6.0   7.0    8.0    9.0    10.0
Category
A           NaN  150.0  156.0  234.0  227.0   45.0  83.0   55.0  177.0  286.0
B         156.0  265.0  183.0    2.0   91.0  191.0  96.0  147.0  106.0  228.0
C         177.0  141.0  140.0  291.0  447.0  148.0  97.0   53.0   16.0   19.0

In [26]:
#Write a data frame to a CSV file
df1.to_csv('output.csv', index=False)

In [94]:
#Write a data frame to an Excel file
df.to_excel('output.xlsx', index=False)

In [95]:
#Write a data frame to a JSON file
df.to_json('output.json')

In [96]:
#Write a data frame to an HTML file
df.to_html('output.html')